app/views/feed/_album.html.erb

SELECT `photos`.* FROM `photos` INNER JOIN `albums_photos` ON `photos`.`id` = `albums_photos`.`photo_id` WHERE `albums_photos`.`album_id` = 5
SELECT COUNT(*) FROM `photos` INNER JOIN `albums_photos` ON `photos`.`id` = `albums_photos`.`photo_id` WHERE `albums_photos`.`album_id` = 5
---
                                                <li class="gallery-item-num rounded-circle text-center py-4">
                                                    <div><%=album.photos.count%></div>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
                                        <img class="rounded-circle h-100" src="https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRzFoduz8sVaT-9UmdS4b7iUdt1msFeu8xm6Q&usqp=CAU" style="height: 30px; width:30px">
                                        <span class="font-weight-bold font-color text-center text-break p-xl-2"><%="#{album.user.firstName} #{album.user.lastName}"%></span>