app/views/feed/_photo.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
                                        <img class="rounded-circle h-100" src="https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRzFoduz8sVaT-9UmdS4b7iUdt1msFeu8xm6Q&usqp=CAU" style="height: 30px; width:30px">
                                        <span class="font-weight-bold font-color text-center text-break p-xl-2"><%="#{photo.user.firstName} #{photo.user.lastName}"%></span>