app/views/discovery/_album.html.erb

                                <div class="col-md-6 photo_feed_avatar gallery-item_feed photo-stack" data-toggle="modal" data-target="#myModal<%=album.id%>">
                                        <%album.photos.each do |photos|%>
---
SELECT `photos`.* FROM `photos` INNER JOIN `albums_photos` ON `photos`.`id` = `albums_photos`.`photo_id` WHERE `albums_photos`.`album_id` = 5

                                                <li class="gallery-item-num rounded-circle text-center py-4">
                                                    <div><%=album.photos.count%></div>
---
SELECT COUNT(*) FROM `photos` INNER JOIN `albums_photos` ON `photos`.`id` = `albums_photos`.`photo_id` WHERE `albums_photos`.`album_id` = 5

                                                <span class="btn-group-toggle btn_discovery_follow ml-auto py-1" style="width:80px" data-toggle="buttons">
                                                  <% if current_user.followings.ids.include?(album.user.id)%>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1