app/views/discovery/_photo.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
                                            <span class="btn-group-toggle btn_discovery_follow ml-auto py-1" style="width:80px" data-toggle="buttons">
                                                <% if current_user.followings.ids.include?(photo.user.id)%>