app/views/albums/show.html.erb

UPDATE `albums` SET `albums`.`title` = 'this is a title new', `albums`.`updated_at` = '2020-08-28 09:50:55.153348' WHERE `albums`.`id` = 9
---
        <td style="border: 1px solid"><%=album.created_at%></td>
        <td style="border: 1px solid"><%=album.updated_at%></td>