app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums` WHERE (9) LIMIT 1
---
    def edit
        @albums = Album.find_by(params[:id])

SELECT `albums`.* FROM `albums` WHERE (5) LIMIT 1
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 5 ORDER BY `albums`.`id` ASC LIMIT 1
UPDATE `albums` SET `albums`.`title` = 'this is a title new', `albums`.`updated_at` = '2020-08-28 09:50:55.153348' WHERE `albums`.`id` = 9
SELECT `albums`.* FROM `albums`
---
    def update
        @albums = Album.find_by(params[:id])
        @a = Album.find(params[:id])
        @a.title = title_params
            if @a.save
                @album = Album.all

SELECT `albums`.* FROM `albums`
---
    def show
        @album = Album.all