app/controllers/albums_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
    def index
        @user = User.find(params[:user_id])

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 5 LIMIT 1
---
    def edit #
        @album = current_user.albums.find(params[:id])