app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaaaaa"], ["text", "1211"], ["created_at", "2020-08-17 03:20:41.589058"], ["updated_at", "2020-08-17 03:20:41.589058"]]
---
    def create
        @article = Article.new(articles_params)
        @comment = @article.comments.create(comment_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "vxvxcvxca"], ["updated_at", "2020-08-17 03:10:14.514091"], ["id", 17]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update(articles_params)