app/controllers/home_controller.rb

SELECT `albums`.* FROM `albums` ORDER BY `albums`.`created_at` ASC LIMIT 4
---
    def newsest
        @albums = Album.order(created_at: :asc).take(4)